[
  {"id":"cardotNonparametricEstimationSmoothed2000","abstract":"This study deals with the simultaneous nonparametric estimations of n curves or observations of a random process corrupted by noise in which sample paths belong to a finite dimension functional subspace. The estimation, by means of B-splines, leads to a new kind of functional principal components analysis. Asymptotic rates of convergence are given for the mean and the eigenelements of the empirical covariance operator. Heuristic arguments show that a well chosen smoothing parameter may improve the estimation of the subspace which contains the sample path of the process. Finally, simulations suggest that the estimation method studied here is advantageous when there are a small number of design points.","accessed":{"date-parts":[["2025",5,8]]},"author":[{"family":"Cardot","given":"Hervé"}],"citation-key":"cardotNonparametricEstimationSmoothed2000","container-title":"Journal of Nonparametric Statistics","DOI":"10.1080/10485250008832820","ISSN":"1048-5252","issue":"4","issued":{"date-parts":[["2000",1,1]]},"page":"503-538","publisher":"Taylor & Francis","source":"Taylor and Francis+NEJM","title":"Nonparametric estimation of smoothed principal components analysis of sampled noisy functions","type":"article-journal","URL":"https://doi.org/10.1080/10485250008832820","volume":"12"},
  {"id":"chenMarginalApproachReducedRank2013","abstract":"Multilevel functional data are collected in many biomedical studies. For example, in a study of the effect of Nimodipine on patients with subarachnoid hemorrhage (SAH), patients underwent multiple 4-hr treatment cycles. Within each treatment cycle, subjects’ vital signs were reported every 10 min. These data have a natural multilevel structure with treatment cycles nested within subjects and measurements nested within cycles. Most literature on nonparametric analysis of such multilevel functional data focuses on conditional approaches using functional mixed effects models. However, parameters obtained from the conditional models do not have direct interpretations as population average effects. When population effects are of interest, we may employ marginal regression models. In this work, we propose marginal approaches to fit multilevel functional data through penalized spline generalized estimating equation (penalized spline GEE). The procedure is effective for modeling multilevel correlated generalized outcomes as well as continuous outcomes without suffering from numerical difficulties. We provide a variance estimator robust to misspecification of correlation structure. We investigate the large sample properties of the penalized spline GEE estimator with multilevel continuous data and show that the asymptotics falls into two categories. In the small knots scenario, the estimated mean function is asymptotically efficient when the true correlation function is used and the asymptotic bias does not depend on the working correlation matrix. In the large knots scenario, both the asymptotic bias and variance depend on the working correlation. We propose a new method to select the smoothing parameter for penalized spline GEE based on an estimate of the asymptotic mean squared error (MSE). We conduct extensive simulation studies to examine property of the proposed estimator under different correlation structures and sensitivity of the variance estimation to the choice of smoothing parameter. Finally, we apply the methods to the SAH study to evaluate a recent debate on discontinuing the use of Nimodipine in the clinical community. Supplementary materials for this article are available online.","accessed":{"date-parts":[["2025",5,8]]},"author":[{"family":"Chen","given":"Huaihou"},{"family":"","given":"Wang ,Yuanjia"},{"family":"","given":"Paik ,Myunghee Cho"},{"family":"Choi","given":"H. Alex","non-dropping-particle":"and"}],"citation-key":"chenMarginalApproachReducedRank2013","container-title":"Journal of the American Statistical Association","DOI":"10.1080/01621459.2013.826134","ISSN":"0162-1459","issue":"504","issued":{"date-parts":[["2013",12,1]]},"page":"1216-1229","PMID":"24497670","publisher":"ASA Website","source":"Taylor and Francis+NEJM","title":"A Marginal Approach to Reduced-Rank Penalized Spline Smoothing With Application to Multilevel Functional Data","type":"article-journal","URL":"https://doi.org/10.1080/01621459.2013.826134","volume":"108"},
  {"id":"eilersPracticalSmoothingJoys2021","abstract":"This is a practical guide to P-splines, a simple, flexible and powerful tool for smoothing. P-splines combine regression on B-splines with simple, discrete, roughness penalties. They were introduced by the authors in 1996 and have been used in many diverse applications. The regression basis makes it straightforward to handle non-normal data, like in generalized linear models. The authors demonstrate optimal smoothing, using mixed model technology and Bayesian estimation, in addition to classical tools like cross-validation and AIC, covering theory and applications with code in R. Going far beyond simple smoothing, they also show how to use P-splines for regression on signals, varying-coefficient models, quantile and expectile smoothing, and composite links for grouped data. Penalties are the crucial elements of P-splines; with proper modifications they can handle periodic and circular data as well as shape constraints. Combining penalties with tensor products of B-splines extends these attractive properties to multiple dimensions. An appendix offers a systematic comparison to other smoothers.","accessed":{"date-parts":[["2024",2,27]]},"author":[{"family":"Eilers","given":"Paul H.C."},{"family":"Marx","given":"Brian D."}],"citation-key":"eilersPracticalSmoothingJoys2021","DOI":"10.1017/9781108610247","event-place":"Cambridge","ISBN":"978-1-108-48295-0","issued":{"date-parts":[["2021"]]},"publisher":"Cambridge University Press","publisher-place":"Cambridge","source":"Cambridge University Press","title":"Practical Smoothing: The Joys of P-splines","title-short":"Practical Smoothing","type":"book","URL":"https://www.cambridge.org/core/books/practical-smoothing/D6A3B6662CCE8D6F570A6030CB5B0F7C"},
  {"id":"xiaoAsymptoticPropertiesPenalized2020","abstract":"Penalized spline methods are popular for functional data analysis but their asymptotic properties have not been established. We present a theoretic study of the $L_{2}$ and uniform convergence of penalized splines for estimating the mean and covariance functions of functional data under general settings. The established convergence rates for the mean function estimation are mini-max rate optimal and the rates for the covariance function estimation are comparable to those using other smoothing methods.","accessed":{"date-parts":[["2025",3,16]]},"author":[{"family":"Xiao","given":"Luo"}],"citation-key":"xiaoAsymptoticPropertiesPenalized2020","container-title":"Bernoulli","DOI":"10.3150/20-BEJ1209","ISSN":"1350-7265","issue":"4","issued":{"date-parts":[["2020",11]]},"page":"2847-2875","publisher":"Bernoulli Society for Mathematical Statistics and Probability","source":"Project Euclid","title":"Asymptotic properties of penalized splines for functional data","type":"article-journal","URL":"https://projecteuclid.org/journals/bernoulli/volume-26/issue-4/Asymptotic-properties-of-penalized-splines-for-functional-data/10.3150/20-BEJ1209.full","volume":"26"},
  {"id":"yaoPenalizedSplineModels2006","abstract":"We propose an iterative estimation procedure for performing functional principal component analysis. The procedure aims at functional or longitudinal data where the repeated measurements from the same subject are correlated. An increasingly popular smoothing approach, penalized spline regression, is used to represent the mean function. This allows straightforward incorporation of covariates and simple implementation of approximate inference procedures for coefficients. For the handling of the within-subject correlation, we develop an iterative procedure which reduces the dependence between the repeated measurements that are made for the same subject. The resulting data after iteration are theoretically shown to be asymptotically equivalent (in probability) to a set of independent data. This suggests that the general theory of penalized spline regression that has been developed for independent data can also be applied to functional data. The effectiveness of the proposed procedure is demonstrated via a simulation study and an application to yeast cell cycle gene expression data.","accessed":{"date-parts":[["2025",5,8]]},"author":[{"family":"Yao","given":"Fang"},{"family":"Lee","given":"Thomas C. M."}],"citation-key":"yaoPenalizedSplineModels2006","container-title":"Journal of the Royal Statistical Society Series B: Statistical Methodology","container-title-short":"Journal of the Royal Statistical Society Series B: Statistical Methodology","DOI":"10.1111/j.1467-9868.2005.00530.x","ISSN":"1369-7412","issue":"1","issued":{"date-parts":[["2006",2,1]]},"page":"3-25","source":"Silverchair","title":"Penalized Spline Models for Functional Principal Component Analysis","type":"article-journal","URL":"https://doi.org/10.1111/j.1467-9868.2005.00530.x","volume":"68"}
]
